УчетВУправляющихДляГит1/src/Documents/УПЖКХ_ЗакрытиеПериодаПоНачислениямЖКХ/УПЖКХ_ЗакрытиеПериодаПоНачислениямЖКХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УПЖКХ_ЗакрытиеПериодаПоНачислениямЖКХ</name>
  <registerRecords>AccumulationRegister.УПЖКХ_Начисления</registerRecords>
  <registerRecords>AccumulationRegister.КВП_ВзаиморасчетыПоЛицевымСчетам</registerRecords>
  <registerRecords>AccumulationRegister.КВП_ПоступлениеДенежныхСредствПоВидамПлатежей</registerRecords>
  <registerRecords>AccumulationRegister.УПЖКХ_НачисленияПоРассрочке</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректировкаРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КВП_ЛицевыеСчета</types>
      <types>CatalogRef.КВП_Здания</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛицевыеСчета</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.КВП_ЛицевыеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Переплаты</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.КВП_ЛицевыеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисления</name>
      <type>
        <types>EnumRef.КВП_ВидыНачисленияОстатки</types>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.КВП_Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>МесяцНачисления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОстатка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Долги</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.КВП_ЛицевыеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисления</name>
      <type>
        <types>EnumRef.КВП_ВидыНачисленияОстатки</types>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.КВП_Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>МесяцНачисления</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МесяцРассрочки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОстатка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачислениеВМесяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентнаяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявлениеНаРассрочку</name>
      <type>
        <types>DocumentRef.УПЖКХ_ЗаявлениеНаРассрочку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Documents/УПЖКХ_ЗакрытиеПериодаПоНачислениямЖКХ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда	

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Проведение

// Функция возвращает параметры проведения.
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.Организация,
	|	Реквизиты.КорректировкаРасчета,
	|	Реквизиты.Комментарий,
	|	Реквизиты.Ответственный,
	|	Реквизиты.Объект
	|ИЗ
	|	Документ.УПЖКХ_ЗакрытиеПериодаПоНачислениямЖКХ КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Реквизиты = Новый Структура("Ссылка,Номер,Дата,Организация,КорректировкаРасчета,
								|Комментарий,Ответственный,Объект");
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	Возврат ПараметрыПроведения;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
